{
  "articles": [
    
    {
      "id": 1,
      "title": "The man who rehabilitated the potato in France",
      "content": "Did you know there was a time when the potato was seen as nothing more than pig food and shunned by the French people, but by the 1700s, this all changed with the efforts of a man named Antoine-Augustin Parmentier, who went on a mission of science-meets-showmanship to make the potato into a staple of French cuisine.\r\n\r\nParmentier was born in 1737 in Montdidier, France, where he was raised by his mother and a local pharmacist after his father's death at a young age. Parmentier would go on to study pharmacy, chemistry, botany, and physics, and he enlisted to join the French army as a pharmacist during the Seven Years' War. During the war, he was captured by the Prussians on a number of occasions, being fed only potatoes while in captivity, an experience that led Parmentier to discover the nutritional value of potatoes as he survived in relatively good health on the potato diet. This sparked his lifelong mission to rehabilitate the potato's reputation in France and establish it as a staple in French cuisine.\r\n\r\nIn order to convince the French public to give the potato a chance, he used a number of methods to achieve this goal. He planted a field of potatoes and had them guarded by soldiers to make them appear valuable and to peak the interest of the general public, as a result people started stealing them, taking them home and cooking them, this caused the demand for them to rise but more importantly showed that they were perfectly safe to eat despite the fears that they caused leprosy amoung other diseases.\r\n\r\nPermentier would host events with the upper class, royals, and foreign dignitaries. He gifted potato flowers to King Louis XVI and Marie Antoinette, who would go on to wear them publicly, sparking curiosity and royal endorsement. A famous case is when he served an American ambassador a meal so delightful, the ambassador saved the recipe and brought it back home. The ambassador was Thomas Jefferson, and the meal was French fries. There was also a declaration at the 1772 Paris Faculty of Medicine that potatoes were edible, all thanks to Parmentier's research. All these things helped in its popularisation.\r\n\r\nIt would take over 20 years for Parmentier to convince the French people to embrace potatoes. Parmentier would continue to promote potatoes. Parmentier would continue to promote potatoes through recipe books and open soup kitchens during times of famine.\r\n\r\nThe legacy of Parmentier's work is visible for all to see, with many dishes having his name and potatoes being a staple of French cuisine.\r\n",
      "category": "History Articles",
      "image": "/uploads/1753897361118.png",
      "created_at": "2025-07-30T17:42:41.468Z",
      "user_id": 1,
      "likes": 0,
      "dislikes": 0,
      "comments": []
    }
  ]
}